# GetReferencesToAllShadingFaces Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassEnergyAnalyticalModel..::..GetReferencesToAllShadingFaces Method
MassEnergyAnalyticalModel Class See Also
---
Get References to all Faces of the MassEnergyAnalyticalModel which are of Mass Shade subcategory.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Reference> GetReferencesToAllShadingFaces()
```

Visual Basic
---
```text
Public Function GetReferencesToAllShadingFaces As IList(Of Reference)
```

Visual C++
---
```text
public:
IList<Reference^>^ GetReferencesToAllShadingFaces()
```

# ### Return Value
Array of Reference to Faces that represent Mass Shades.
# Remarks
Called out as a separate convenience method because often it is more useful to obtain information about non-shading faces from the zones, and only get information about shading faces from the MassEnergyAnalyticalModel.
# See Also
MassEnergyAnalyticalModel Class
Autodesk.Revit.DB.Analysis Namespace